# 此脚本可更改的内容会有"______"标记(6个_)
# 请使用GB2312编码编辑脚本[推荐使用专业编辑器编辑,比如VSCode, Notepad++等]
# Please edit the script using GB2312 encoding
# 以下为脚本内容


print('++++++++++++++++++++++++++++++++++++++++++++++++++++++')
print('欢迎%username%使用此脚本!')
print('脚本版本: 1.1-python')
print('此脚本为快照版, 有BUG请私信QQ: 2035381689')
print('---------------------------')
print('更新计划:')
print(' 严重问题:')
print('   1.后台打中文出现乱码')
print(' 预更新内容:')
print('   2.尝试转GBK编码为GB2312编码')
print('---------------------------')
print('          按任意键开启服务器')
print('++++++++++++++++++++++++++++++++++++++++++++++++++++++')



# 预处理[多核心更换]
 # 如果服务器有多个核心, 且用不同的API, 用下面的命令解禁/禁用模组
 # 禁用 ren .\mods\______.jar ______.jar.ban
 # 解禁 ren .\mods\______.jar.ban ______.jar
 # 调整核心则用
 # 禁用 ren .\______.jar ______.jar.ban
 # 解禁 ren .\______.jar.ban ______.jar
 # 将命令打在本行注释下面

print('test'+'Okay')

# 开服命令设置
#:Start 
# 设置变量n=0
n=0
while n<10:
    print('=========================================')
    print('              服务器正在开启')
    print('          The server is starting!')
    print('=========================================')
    # 开服[GB2312编码]
    # "______.jar"填服务器核心名, "-Xmx______"内存占用最大值, "-Xms______"内存占用最小值, 单位M或G(1024M=1G)
    print('Server'+'Start')
    # 在n=______[重启n-1次]时转到崩溃输出
    #  if %n%==______ goto Crash
    # goto Start
    n=n+1

str(n)

# 崩溃输出
print('=========================================')
print('            '+'服务器已崩溃'+n+'次')
print('        重新开启脚本以重启服务器')
print('=========================================')
exit()